## 1 对分组进行迭代

In [57]:
import pandas as pd

In [58]:
path = './Repo/分组聚合.xlsx'

In [59]:
df = pd.read_excel(path)

In [60]:
df

    城市    区  人数  金额
0  北京市  西城区  37  74
1   天津  和平区  48  96
2  北京市  东城区  40  80
3   天津  南开区  34  68
4  北京市  西城区  49  98
5   天津  南开区  44  88
6   天津  和平区  49  98
7  北京市  东城区  48  96
8  北京市  西城区  26  52
9   天津  南开区  30  60

In [61]:
for (i, j), group in df.groupby(['城市', '区']):
    print(i, j) # 城区
    print(group) # df

北京市 东城区
    城市    区  人数  金额
2  北京市  东城区  40  80
7  北京市  东城区  48  96
北京市 西城区
    城市    区  人数  金额
0  北京市  西城区  37  74
4  北京市  西城区  49  98
8  北京市  西城区  26  52
天津 南开区
   城市    区  人数  金额
3  天津  南开区  34  68
5  天津  南开区  44  88
9  天津  南开区  30  60
天津 和平区
   城市    区  人数  金额
1  天津  和平区  48  96
6  天津  和平区  49  98

## 2 分组聚合

In [62]:
path = './Repo/分组聚合.xlsx'

In [63]:
df = pd.read_excel(path)

In [64]:
df2 = df.groupby(['城市', '区'])[['人数']].sum()
df2

          人数
城市  区
北京市 东城区   88
    西城区  112
天津  南开区  108
    和平区   97

In [65]:
df3 = df.groupby(['城市', '区'])[['人数', '金额']].sum()
df3

          人数   金额
城市  区
北京市 东城区   88  176
    西城区  112  224
天津  南开区  108  216
    和平区   97  194

In [66]:
path = './Repo/分组聚合2.xlsx'
df = pd.read_excel(path, index_col = '店号')
df

      1月  2月  3月  4月
店号
1店    25  77  76  29
2店    49  84  95  75
25店   57  80  44  28
35店   46  25  95  37
105店  57  84  95  37
225店  57  77  76  28

In [67]:
dict = {
    '1月': 'count',
    '2月': 'sum',
    '3月': 'max',
    '4月': 'mean'
}

In [68]:
df4 = df.groupby('店号').agg(dict)
df4

      1月  2月  3月    4月
店号
105店   1  84  95  37.0
1店     1  77  76  29.0
225店   1  77  76  28.0
25店    1  80  44  28.0
2店     1  84  95  75.0
35店    1  25  95  37.0

## 3 使用字典和Series分组

In [69]:
path = './Repo/分组聚合2.xlsx'

In [70]:
df = pd.read_excel(path, index_col = '店号')

In [71]:
df

      1月  2月  3月  4月
店号
1店    25  77  76  29
2店    49  84  95  75
25店   57  80  44  28
35店   46  25  95  37
105店  57  84  95  37
225店  57  77  76  28

In [72]:
对应关系 = {'1月':'一季度','2月':'一季度','3月':'一季度','4月':'二季度'}
数据2 = df.groupby(对应关系,axis=1)
print(数据2.sum())

      一季度  二季度
店号
1店    178   29
2店    228   75
25店   181   28
35店   166   37
105店  236   37
225店  210   28

C:\Users\95432\AppData\Local\Temp\ipykernel_12876\1157648449.py:2: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  数据2 = df.groupby(对应关系,axis=1)

## 4 通过函数分组（罕见）

In [73]:
import pandas as pd
路径 = './Repo/分组聚合.xlsx'
数据 = pd.read_excel(路径,index_col='城市')
数据2 = 数据.groupby(len).sum()
print(数据2)


import pandas as pd
路径 = './Repo/分组聚合2.xlsx'
数据 = pd.read_excel(路径,index_col='店号')
S1 = ['北京','北京','北京','北京','天津','天津']
数据2= 数据.groupby([len,S1]).min()
print(数据2)

                  区   人数   金额
城市
2   和平区南开区南开区和平区南开区  205  410
3   西城区东城区西城区东城区西城区  200  400
       1月  2月  3月  4月
店号
2  北京  25  77  76  29
3  北京  46  25  44  28
4  天津  57  77  76  28

## 5 通过索引级别分组

In [74]:
路径 = './Repo/分组聚合3.xlsx'
数据 = pd.read_excel(路径,index_col=[0,1])
数据

       语文  数学
班级 性别
一班 男   55  68
   女   76  76
二班 男   51  65
   女   54  69
三班 男   50  78
   女   51  76
四班 男   80  67
   女   62  70

In [75]:
数据3 = 数据.groupby(level='班级').mean()
print(数据3)

      语文    数学
班级
一班  65.5  72.0
三班  50.5  77.0
二班  52.5  67.0
四班  71.0  68.5

In [76]:
路径 = './Repo/分组聚合4.xlsx'

In [77]:
数据 = pd.read_excel(路径,header=[0,1])
L1 = ['1季度','1季度','1季度','2季度','2季度']
L2 = ['1月','2月','3月','4月','5月']
多层索引 = pd.MultiIndex.from_arrays([L1,L2],names=['季度','月份'])

In [78]:
多层索引

MultiIndex([('1季度', '1月'),
            ('1季度', '2月'),
            ('1季度', '3月'),
            ('2季度', '4月'),
            ('2季度', '5月')],
           names=['季度', '月份'])

In [79]:
数据2 = pd.DataFrame(数据,columns=多层索引)
数据2

季度 1季度         2季度
月份  1月  2月  3月  4月  5月
0   44  28  40  21  28
1   22  34  41  37  38
2   28  23  48  37  32
3   39  20  33  20  35
4   37  49  49  21  40
5   25  40  24  33  47

In [80]:
数据3 = 数据2.groupby(level='季度',axis=1).sum()
print(数据3)

季度  1季度  2季度
0   112   49
1    97   75
2    99   69
3    92   55
4   135   61
5    89   80

C:\Users\95432\AppData\Local\Temp\ipykernel_12876\2901680766.py:1: FutureWarning: DataFrame.groupby with axis=1 is deprecated. Do `frame.T.groupby(...)` without axis instead.
  数据3 = 数据2.groupby(level='季度',axis=1).sum()